/*题目描述

时钟加法是指给定一个当前时间，其形式为h:m:s，计算加上n秒后新的时间。你能帮他编程实现吗？

输入描述
多个样例。每个样例输入1行形式为h:m:s+n的数据，其中h(0≤h≤23)代表小时，m(0≤m≤59)代表分钟，s(0≤s≤59)代表秒钟，n(1≤n≤105)代表经过的秒数。

输出描述
每个样例输出新的时间，形式为h:m:s。每个样例输出结果占一行。

输入样例
0:0:0+360
23:29:59+1801
7:8:15+1
输出样例
00:06:00
00:00:00
07:08:16
*/
#include <stdio.h>
int main()
{
    int h,m,s;
    int n;
    while (scanf("%d:%d:%d+%d",&h,&m,&s,&n)!=EOF)
    {
        s=n+s;
        if (s >= 60)
        {
            m += s/60;
            s = s%60;

            if (m >= 60)
            {
                h += m/60;
                m = m%60;
                if (h>=24)
                {
                    h=h%24;
                }
                
            }
            
        }
        printf("%02d:%02d:%02d\n",h,m,s);
    }
    return 0;
}